export class ChartsOptions {
    options = [
        {
            'menu_name': '业务统计',
            'charts': [
                {
                    'name': '医生业务量统计',
                    'type': 'bar',
                    'legend': [ '数量' ],
                    'legend_name': '',
                    'xAxis_name': 'diagnosis',
                    'xAxis': ['管海涛', '代志军', '闵卫利', '马宇光', '尹晓然', '刁岩', '梁亮', '惠文涛', '金迎迎', '马秀龙',
                        '王中卫', '康华峰', '王亚利', '', '昝瑛', '张淑群', '张寅斌', '白明华', '康华锋', '任宏涛',
                        '宋玲琴', '王宝峰', '马小斌', '赵阳', '刘棣', '薛兴欢', '郭亚', '这张淑群', '梁亮’', '柯悦',
                        '张淑琴', '官海天', '刘小旭'],
                    'series': [
                        [ 1331, 710, 688, 594, 572, 475, 471, 402, 401, 290, 283, 214, 213, 194, 176, 171, 164, 145, 69,
                            61, 51, 29, 27, 15, 12, 2, 1, 1, 1, 1, 1, 1, 1]
                    ]

                },
                {
                    'name': '医疗付费方式',
                    'type': 'pie',
                    'legend': [
                        '新型农村合作医疗', '城镇职工基本医疗保险', '城镇居民基本医疗保险', '全自费', '全公费',
                        '其他社会保险', '商业医疗保险', '其他', '不详'],
                    'series': [
                        {
                            name: '医疗付费方式',
                            type: 'pie',
                            radius : [30, 110],
                            center : ['50%', 200],
                            roseType : 'area',
                            x: '50%',
                            max: 2107,
                            sort : 'ascending',
                            data: [
                                {value: 1574, name: '新型农村合作医疗'},
                                {value: 2107, name: '城镇职工基本医疗保险'},
                                {value: 483, name: '城镇居民基本医疗保险'},
                                {value: 247, name: '全自费'},
                                {value: 4, name: '全公费'},
                                {value: 48, name: '其他社会保险'},
                                {value: 3, name: '商业医疗保险'},
                                {value: 2025, name: '其他'},
                                {value: 1285, name: '不详'}
                            ]
                        }]
                },
                {
                    'name': '平均住院日统计',
                    'type': 'bar',
                    'legend': [ '外科组', '内科组', '放疗组' ],
                    'legend_name': '',
                    'xAxis_name': 'diagnosis',
                    'xAxis': ['2017.3', '2017.4', '2017.5', '2017.6', '2017.7', '2017.8', '2017.9', '2017.10', '2017.11'],
                    'series': [
                        [ 8.16, 7.92, 7.15, 6.19, 7.71, 6.69, 5.43, 20.0, 15.0 ],
                        [ 7.49, 7.57, 7.2, 6.26, 7.13, 6.8, 6.11, 6.21, 5.99 ],
                        [ 7.35, 7.67, 7.32, 6.38, 9.54, 8.04, 7.43, 7.22, 5.94]
                    ]
                },
                {
                    'name': '平均住院花费统计',
                    'type': 'bar',
                    'legend': [ '外科组', '内科组', '放疗组' ],
                    'legend_name': '',
                    'xAxis_name': 'diagnosis',
                    'xAxis': ['2017.3', '2017.4', '2017.5', '2017.6', '2017.7', '2017.8', '2017.9', '2017.10', '2017.11'],
                    'series': [
                        [ 8924.9, 10318.29, 16268.96, 15223.56, 15010.4, 12731.17, 13808.09, 60410.51, 19820.54 ],
                        [ 13488.08, 12709.46, 13657.17, 13276.95, 13177.03, 12667.98, 12070.14, 12677.71, 12251.56],
                        [ 10877.34, 13383.08, 15176.43, 14303.81, 17921.23, 16581.08, 16723.33, 16132.35, 14520.86]
                    ]
                },
                {
                    'name': '平均住院花费与住院日比统计',
                    'type': 'bar',
                    'legend': [ '外科组', '内科组', '放疗组' ],
                    'legend_name': '',
                    'xAxis_name': 'diagnosis',
                    'xAxis': ['2017.3', '2017.4', '2017.5', '2017.6', '2017.7', '2017.8', '2017.9', '2017.10', '2017.11'],
                    'series': [
                        [ 1093.74, 1302.81, 2275.38, 2459.38, 1946.87, 1903.01, 2542.93, 3020.53, 1321.37 ],
                        [ 1800.81, 1678.92, 1896.83, 2120.92, 1848.11, 1862.94, 1975.47, 2041.5, 2045.34],
                        [ 1479.91, 1744.86, 2073.28, 2241.98, 1878.54, 2062.32, 2250.78, 2234.4, 2444.59]
                    ]
                }

            ]
        },
        {
            'menu_name': '患者统计',
            'charts': [
                {   'name': '入院患者年龄统计',
                    'filter_name': 'diagnosis',
                    'type': 'bar',
                    'legend': ['患病'],
                    'xAxis': ['<20', '20-30', '30-40', '40-50', '50-60', '60-70', '>70'],
                    'series': [
                        [40, 351, 818, 2087, 2319, 1577, 584]
                    ]

                },
                {   'name': '城市分布统计',
                    'type': 'bar',
                    'legend': ['乳腺恶性肿瘤'],
                    'xAxis': ['西安市', '咸阳市', '渭南市', '延安市', '铜川市', '宝鸡市', '榆林市', '庆阳市', '商洛市',
                        '韩城市', '兰州市', '安康市', '华阴市', '汉中市', '兴平市'],
                    'series': [
                        [674, 106, 63, 40, 39, 24, 15, 8, 6, 5, 4, 3, 3, 1, 1]
                    ]
                },
                {
                    'name': '乳腺癌城市分布统计',
                    'type': 'map',
                    'legend': ['乳腺恶性肿瘤'],
                    'mapType': ['陕西'],
                    'series': [[
                        {name: '西安市', value: 674 },
                        {name: '咸阳市', value: 106 },
                        {name: '渭南市', value: 63 },
                        {name: '延安市', value: 40 },
                        {name: '铜川市', value: 39 },
                        {name: '宝鸡市', value: 24 },
                        {name: '榆林市', value: 15 },
                        {name: '商洛市', value: 6 },
                        {name: '安康市', value: 3 },
                        {name: '华阴市', value: 3 },
                        {name: '汉中市', value: 1 },
                        {name: '兴平市', value: 1 }
                    ]]
                },
                {
                    'name': '4898例乳腺癌(按主要诊断代码分)分类统计',
                    'type': 'pie',
                    'legend': [
                        'N63.x00', 'C79.806', 'C73.x00', 'N60.202', 'C50.901',
                        'C50.900', 'D48.601', 'N64.901', 'C82.700', 'N64.900', 'N64.900', 'D24.x00', 'N64.504'],
                    'series': [
                        {
                            name: '4898例乳腺癌(按主要诊断代码分)分类统计',
                            type: 'pie',
                            radius : [30, 110],
                            center : ['50%', 200],
                            roseType : 'area',
                            x: '50%',
                            max: 2107,
                            sort : 'ascending',
                            data: [
                                {value: 110, name: 'N63.x00'},
                                {value: 1, name: 'C79.806'},
                                {value: 33, name: 'C73.x00'},
                                {value: 23, name: 'N60.202'},
                                {value: 8, name: 'C50.901'},
                                {value: 3735, name: 'C50.900'},
                                {value: 943, name: 'D48.601'},
                                {value: 1, name: 'N64.901'},
                                {value: 3, name: 'C82.700'},
                                {value: 3, name: 'N64.900'},
                                {value: 1, name: 'N64.900'},
                                {value: 19, name: 'D24.x00'},
                                {value: 18, name: 'N64.504'}
                            ]
                        }]
                },
                {
                    'name': '乳腺恶性肿瘤年龄分布统计',
                    'type': 'pie',
                    'legend': [
                        '20岁以下', '20~30岁', '30~40岁', '40~50岁', '50~60岁',
                        '60岁以上'],
                    'series': [
                        {
                            name: '乳腺',
                            type: 'pie',
                            radius : [30, 110],
                            center : ['50%', 200],
                            roseType : 'area',
                            x: '50%',
                            max: 2107,
                            sort : 'ascending',
                            data: [
                                {value: 0, name: '20岁以下'},
                                {value: 79, name: '20~30岁'},
                                {value: 453, name: '30~40岁'},
                                {value: 1169, name: '40~50岁'},
                                {value: 1236, name: '50~60岁'},
                                {value: 798, name: '60岁以上'},
                            ]
                        }]
                },
            ]
        },
        {
            'menu_name': '医生统计',
            'charts': [
                {
                    'name': 'demo4',
                    'type': 'bar',
                    'legend': ['1', '2', '3'],
                    'xAxis': ['1月', '2月', '3月', '4月', '5月', '6月', '7月', '8月', '9月', '10月', '11月', '12月'],
                    'series': [
                        [ 2, 3, 4, 5, 9, 11, 22, 3, 1, 10, 4, 1],
                        [ 16, 7, 3, 2, 8, 14, 21, 3, 1, 6, 3, 1],
                        [ 3, 4, 5, 9, 11, 22, 16, 7, 3, 2, 8, 14]
                    ]

                },
                {   'name': 'demo9',
                    'type': 'bar',
                    'legend': ['a', 'c', 'd'],
                    'xAxis': ['周一', '周二', '周三', '周四', '周五', '周六', '周日'],
                    'series': [
                        [ 16, 7, 3, 2, 8, 14, 22],
                        [ 22, 3, 1, 10, 4, 1, 21],
                        [ 3, 4, 5, 9, 11, 22, 16]
                    ]

                }
            ]
        }
    ];

}
